Revit 2027 API
IPerformanceAdviserRule.GetDescription Method
 Retrieves the description of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetDescription()
Function GetDescription As String
String^ GetDescription()
abstract GetDescription : unit -> string
Return Value
String
 The description of the rule.
Remarks
 Method should return a brief (one-two sentences) description of the rule. String should be localized.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace